Examinator/src/InformationRegisters/РасписаниеПреподавателейСУО/РасписаниеПреподавателейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеПреподавателейСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РасписаниеПреподавателейСУО/ManagerModule.bsl
Функция ВыбратьЭлементыРасписания(Пользователь, НачалоПериода=Неопределено, КонецПериода=Неопределено) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();

	Запрос.Параметры.Вставить("Пользователь", Пользователь);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийРасписаниеПреподавателейСУО.Регистратор КАК ПроведениеОбученияПреподавателем,
		|	РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения,
		|	РегистрСведенийРасписаниеПреподавателейСУО.ДатаОкончанияПроведения,
		|   РегистрСведенийРасписаниеПреподавателейСУО.Преподаватель КАК Пользователь,
		|   РегистрСведенийРасписаниеПреподавателейСУО.Преподаватель КАК Преподаватель
		|ИЗ
		|	РегистрСведений.РасписаниеПреподавателейСУО КАК РегистрСведенийРасписаниеПреподавателейСУО
		|ГДЕ
		|	РегистрСведенийРасписаниеПреподавателейСУО.Преподаватель В(&Пользователь)
		|	И РегистрСведенийРасписаниеПреподавателейСУО.Проведено = ЛОЖЬ";
		
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда			   
				   
		Запрос.Текст = Запрос.Текст + "			   
		|	И (РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения = &ПустаяДата
		|			ИЛИ РегистрСведенийРасписаниеПреподавателейСУО.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения < &НачалоПериода
		|				И РегистрСведенийРасписаниеПреподавателейСУО.ДатаОкончанияПроведения > &КонецПериода)";
					   
		Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
		Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
		Запрос.Параметры.Вставить("ПустаяДата", Дата("00010101"));
	
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции
